if __name__ == '__main__':
    # 按每组的第二个元素排序（默认为升序）
    ls = [[1, 9], [2, 8], [3, 7]]
    ls.sort(key=lambda x: x[1])
    print(ls)  # [[3, 7], [2, 8], [1, 9]]

    # 按每组的第二个元素排序（降序）
    ls_1 = sorted(ls, key=lambda x: x[1], reverse=True)
    print(ls_1)  # [[1, 9], [2, 8], [3, 7]]
    print(ls)  # [[3, 7], [2, 8], [1, 9]]

    """
    注意：
    1.sort() 是直接原地修改列表。
    2.sorted() 会创建一个新的列表（浅拷贝）-> 内部嵌套的数组实际复制的是其地址，指向的还是同一块内存。
    """
    ls_1[0][1] = 6
    print(ls_1)  # [[1, 6], [2, 8], [3, 7]]
    print(ls)  # [[3, 7], [2, 8], [1, 6]]，原数组也发生了变化
