import copy

if __name__ == '__main__':
    # 创建列表
    ls = [0, 1, 2, 3, 4, 5]

    # 获取列表的最大值、最小值
    max(ls)
    min(ls)

    # 列表翻转、部分翻转（切片法）
    # 列表[终点:起点:-1] -> 翻转(起点,终点]
    ls_1 = ls[5::-1]
    print(ls_1)  # [5, 4, 3, 2, 1, 0]
    ls_2 = ls[4:2:-1]
    print(ls_2)  # [4, 3]

    # 创建二维数组
    grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

    # 浅拷贝
    # 当列表嵌套时，只有第一层是深拷贝，实际拷贝的是地址，修改内层元素，实际修改的是同一份数据。
    grid_1 = grid.copy()
    grid_1[0][1] = 0
    print(grid)  # [[1, 0, 3], [4, 5, 6], [7, 8, 9]]
    print(grid_1)  # [[1, 0, 3], [4, 5, 6], [7, 8, 9]]

    # 深拷贝
    grid_2 = copy.deepcopy(grid)
    grid_2[1][1] = 0
    print(grid)  # [[1, 0, 3], [4, 5, 6], [7, 8, 9]]
    print(grid_2)  # [[1, 0, 3], [4, 0, 6], [7, 8, 9]]
